experiment-finetuned/all_finetuned/runs/counterFlowFlame2D/2/constant/reactions
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      reactions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

species
(
    CH4
    O2
    N2
    H2O
    CO2
);

reactions
{
    methaneReaction
    {
        type        irreversibleArrheniusReaction;
        reaction    "CH4 + 2O2 = CO2 + 2H2O";
        A           7.798e+06;
        beta        0;
        Ta          21780;
    }
}

// ************************************************************************* //