experiment-finetuned/all_finetuned/runs/counterFlowFlame2D/2/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    fuel
    {
        type            fixedValue;
        value           uniform 101325;
    }
    air
    {
        type            fixedValue;
        value           uniform 101325;
    }
    outlet
    {
        type            waveTransmissive;
        field           p;
        psi             thermo:psi;
        gamma           1.4;
        fieldInf        101325;
        lInf            0.1;
        value           uniform 101325;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //