experiment-finetuned/all_finetuned/runs/counterFlowFlame2D/2/0/N2
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      N2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.78;

boundaryField
{
    fuel
    {
        type            fixedValue;
        value           uniform 0.0;
    }
    air
    {
        type            fixedValue;
        value           uniform 0.78;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.78;
        value           uniform 0.78;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //