experiment-finetuned/all_finetuned/runs/counterFlowFlame2D/2/0/T
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    fuel
    {
        type            fixedValue;
        value           uniform 300;
    }
    air
    {
        type            fixedValue;
        value           uniform 300;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           uniform 300;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //