experiment-finetuned/all_finetuned/runs/counterFlowFlame2D/2/0/Ydefault
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Y;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    fuel
    {
        type            fixedValue;
        value           uniform 1;
    }
    air
    {
        type            fixedValue;
        value           uniform 1;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //